HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_АктыВыполненныхРаботы/ДБ_АктыВыполненныхРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДБ_АктыВыполненныхРаботы</name>
  <registerRecords>AccumulationRegister.ДБ_АктыВыполненияРабот</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.ДБ_Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/AccumulationRegisters/ДБ_АктыВыполненияРабот/ДБ_АктыВыполненияРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДБ_АктыВыполненияРабот</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ДБ_Задачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_АктыВыполненныхРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого ТекСтрока Из ВыполненныеЗадачи Цикл
		НоваяСтрока = Движения.ДБ_АктыВыполненияРабот.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Заказчик = Заказчик;
		НоваяСтрока.Задача = ТекСтрока.Задача;
		НоваяСтрока.Сумма = ТекСтрока.Сумма;
	КонецЦикла;
	
	Движения.ДБ_АктыВыполненияРабот.Записывать            = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


#КонецЕсли
